using System;
using Microsoft.VisualStudio.TestTools.UnitTesting;
using Moq;
using SchoolWebProject.Domain.Models;
using System.Collections.Generic;
using SchoolWebProject.Infrastructure;
using SchoolWebProject.Data.Infrastructure;
using SchoolWebProject.Services;
using SchoolWebProject.Services.Models;

namespace UnitTest
{
    [TestClass]
    public class AnnouncementServiceUnitTest
    {
        private List<Announcement> announcements = new List<Announcement>
      {
                new Announcement
                {
                    Title = "І етап адаптаційних занять для майбутніх першокласників",
                    Message = "Оголошуємо набір учнів у 1-ий клас на 2016-2017 н.р.",
                    MessageDetails = "Вітаємо всіх учасників навчально-виховного процесу, особливо батьків та малюків, що сьогодні відвідали перші заняття!"+
                    "Відомо, що початок шкільного життя для багатьох дітей часто пов'язаний зі зміною способу життя, адже довкола все нове, невідоме, незвідане. А тому психологічну підготовку дитини до школи варто починати заздалегідь.Адаптаційні заняття, покликані, насамперед, сформувати позитивне ставлення дитини до школи та інтерес до навчання: цікаві математичні і логічні завдання, вправи на розвиток мовлення та навички письма, малювання, музика та інформатика, нові знайомства, спілкування, правила поведінки на уроках та під час перерв, нова роль – роль учня",
                    DataPublished = new DateTime(2015, 9, 11),
                    Image = "some image in base64 format",
                    SchoolId = 1
                },
                 new Announcement
                {
                    Title = "День учнівського самоврядування",
                    Message = "Сьогодні в школі відбувся День учнівського самоврядування. Захід проводився з метою пропагування серед учнівської молоді основних засад місцевого самоврядування",
                    MessageDetails = "У Дні учнівського самоврядування взяли участь учні 9-11-х класів та лідери Учнівського парламенту. Старшокласники мали можливість попробувати себе в ролі педагога, зрозуміти і відчути, як це – бути вчителем."+
                    "Робочий день розпочався з апаратної наради, яку провела  президент УП, яка виконувала відповідно до визначених повноважень функціональні обов'язки директора школи. Вікторія ознайомила представників учнівського самоврядування із Планом Дня самоврядування."+
                    "Весь навчальний процес школи в цей день проходив під чітким контролем дублерів адміністрації школи. І для того, щоб уроки проходили у нормальному режимі, потрібна була ретельна підготовка. Заздалегідь «майбутні вчителі» ознайомилися з навчальним матеріалом,"+
                    " який вони повинні дати учням. Самостійно підбирали цікавий матеріал. «Майбутні вчителі» проявили неабияку наполегливість і старанність, щоб підготуватися до уроків.",
                    DataPublished = new DateTime(2015, 10, 2),
                    Image="some image in base64 format",
                    SchoolId = 1
                },
                 new Announcement
                {
                    Title = "Виставка малюнків - Золота Осінь",
                    Message = "Сьогодні відбулась загальношкільна виставка малюнків учнів. У конкурсі приймали участь діти молодшої школи. Їхні малюнки розповідають про неповторну чарівність золотої осені.  ",
                    DataPublished = new DateTime(2015, 10, 9),
                    Image = "some image in base64 format",
                    SchoolId = 1
                },
                new Announcement
                {
                    Title = "Святий Миколай іде до сиріт",
                    Message = "Багато років поспіль, ще задовго до свята Миколая, Мальтійська Служба Допомоги на початку листопада розпочинає традиційну акцію.",
                    MessageDetails = "Метою акції є приготування подарунків дітям та сиротам, які проживають в інтернатах і дитячих будинках Івано-Франківська та області до дня Святого Миколая, а також забезпечення їх речима першої необхідності."+
                                      "1800 листів до святого Миколая від сиріт та дітей, що позбавлені батьківського тепла чекають нашої підтримки! У листах дітки пишуть не тільки про омріяні подарунки, які б вони хотіли отримати, а також розказують" + 
                                      " про себе, свої уподобання, свої мрії та особливі здібності. Пишуть також про те, що болить і чого бракує. З такого листа можна багато дізнатись про дитинку і вже обрати для кого ж то можна подарувати трішки радості," + 
                                      " тепла та щастя.Такого листа до Святого Миколая можна отримати в приміщенні Мальтійської Служби Допомоги" +
                                      "Святково - запакований подарунок потрібно принести у офіс Мальтійської Служби у термін до 10 грудня. ",
                    DataPublished = new DateTime(2015, 11, 19),
                    Image = "some image in base64 format",
                    SchoolId = 1
                }  
      };

        private Announcement announcement = new Announcement
        {
            Title = "І етап адаптаційних занять для майбутніх першокласників",
            Message = "Оголошуємо набір учнів у 1-ий клас на 2016-2017 н.р.",
            MessageDetails = "Вітаємо всіх учасників навчально-виховного процесу, особливо батьків та малюків, що сьогодні відвідали перші заняття!" +
            "Відомо, що початок шкільного життя для багатьох дітей часто пов'язаний зі зміною способу життя, адже довкола все нове, невідоме, незвідане. А тому психологічну підготовку дитини до школи варто починати заздалегідь.Адаптаційні заняття, покликані, насамперед, сформувати позитивне ставлення дитини до школи та інтерес до навчання: цікаві математичні і логічні завдання, вправи на розвиток мовлення та навички письма, малювання, музика та інформатика, нові знайомства, спілкування, правила поведінки на уроках та під час перерв, нова роль – роль учня",
            DataPublished = new DateTime(2015, 9, 11),
            Image = "some image in base64 format",
            SchoolId = 1
        };

        private ViewAnnouncement viewannouncement = new ViewAnnouncement
        {
            Title = "І етап адаптаційних занять для майбутніх першокласників",
            Message = "Оголошуємо набір учнів у 1-ий клас на 2016-2017 н.р.",
            MessageDetails = "Вітаємо всіх учасників навчально-виховного процесу, особливо батьків та малюків, що сьогодні відвідали перші заняття!" +
            "Відомо, що початок шкільного життя для багатьох дітей часто пов'язаний зі зміною способу життя, адже довкола все нове, невідоме, незвідане. А тому психологічну підготовку дитини до школи варто починати заздалегідь.Адаптаційні заняття, покликані, насамперед, сформувати позитивне ставлення дитини до школи та інтерес до навчання: цікаві математичні і логічні завдання, вправи на розвиток мовлення та навички письма, малювання, музика та інформатика, нові знайомства, спілкування, правила поведінки на уроках та під час перерв, нова роль – роль учня",
            DataPublished = new DateTime(2015, 9, 11),
            Image = "some image in base64 format"
        };

        [TestMethod]
        public void GetAllAnnouncements_Test_If_Get_All_Announcement_Invoke_repository_GetAll()
        {
            //Arange
            var logger = new Mock<ILogger>();
            var iUnitOfWork = new Mock<IUnitOfWork>();
            var iRepository = new Mock<IRepository<Announcement>>();
            iUnitOfWork.Setup(st => st.AnnouncementRepository).Returns(iRepository.Object);
            var announcementService = new AnnouncementService(logger.Object, iUnitOfWork.Object);
            //Act
            announcementService.GetAllAnnouncements();
            //Assert
            iRepository.Verify(inv => inv.GetAll(), Times.Once);
        }

        [TestMethod]
        public void GetAnnouncementById_Test_Is_Invoke_repository_GetById()
        {
            //Arrange
            var logger = new Mock<ILogger>();
            var iRepository = new Mock<IRepository<Announcement>>();
            var iUnitOfWork = new Mock<IUnitOfWork>();
            iUnitOfWork.Setup(st => st.AnnouncementRepository).Returns(iRepository.Object);
            var announcementService = new AnnouncementService(logger.Object, iUnitOfWork.Object);
            int anyIdMoreZero = 2;
            //Act
            announcementService.GetAnnouncementById(anyIdMoreZero);
            //Assert
            iRepository.Verify(inv => inv.GetById(anyIdMoreZero), Times.Once);
        }
    }
}
